InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омБитриксКоманды/Ext/Module.bsl
Функция Отправка_запроса_к_битрикс(ИмяКоманды, СтрокаJSON, стТокен = Неопределено)
	
	Если стТокен = Неопределено Тогда
		
		ПодключениеКБитрикс = Константы.НастройкаПодключенияКБитриксПоУмолчанию.Получить();
		ИмяКомандыСПараметрами = ПодключениеКБитрикс.ВходящийВебхук + "/" + ИмяКоманды;
		Портал = ПодключениеКБитрикс.Портал;
		
	Иначе
		
		ИмяКомандыСПараметрами = ИмяКоманды;
		Портал = стТокен.Портал;
	
	КонецЕсли;
	
	запросPOST = Новый HTTPЗапрос("rest/" + ИмяКомандыСПараметрами); 
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", 	"application/json");
	Заголовки.Вставить("Accept", 		"application/json");

	запросPOST.Заголовки = Заголовки;
	HTTPСоединение = Новый HTTPСоединение(Портал,
							443,	// порт, по умолчанию для http используется 80, для https 443
							, 		// пользователь для доступа к серверу (если он есть)
							, 		// пароль для доступа к серверу (если он есть)
							,       // Тайм аут
							,		// здесь указывается прокси, если он есть
						   Новый ЗащищенноеСоединениеOpenSSL());
						   
   Если НЕ ПустаяСтрока(СтрокаJSON) Тогда
	   запросPOST.УстановитьТелоИзСтроки(СтрокаJSON,"windows-1251",ИспользованиеByteOrderMark.НеИспользовать);
   КонецЕсли;
   
   Попытка
	   
	   Ответ = HTTPСоединение.ОтправитьДляОбработки(запросPOST,);
	   
   Исключение
	   Возврат Неопределено;   
   КонецПопытки;
   
   ЧтениеJSON = Новый ЧтениеJSON();
   ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
   СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
   ЧтениеJSON.Закрыть();
   
   Возврат СтруктураОтвета;
	
КонецФункции // ПолучитьСотрудниковИзБитрикс()

&НаСервере
Функция ПолучитьТокен()
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	мДанныеДляПолученияТокена = Новый Массив(6);
	мДанныеДляПолученияТокена[0] = ОбъектОтчета.ПолучитьИмяНастройкиСекретныйКлючAPI();
	мДанныеДляПолученияТокена[1] = ОбъектОтчета.ПолучитьИмяВремяЖизниКлючаAPI();
	мДанныеДляПолученияТокена[2] = ОбъектОтчета.ПолучитьИмяНастройкиДатаСозданияКлючаAPI();
	мДанныеДляПолученияТокена[3] = ОбъектОтчета.ПолучитьИмяНастройкиТокенAPIБитрикс();
	мДанныеДляПолученияТокена[4] = ОбъектОтчета.ПолучитьИмяКодПриложенияAPI();
	мДанныеДляПолученияТокена[5] = ОбъектОтчета.ПолучитьИмяКлючПриложенияAPI();
	
	ПодключениеКБитрикс 		= Константы.НастройкаПодключенияКБитриксПоУмолчанию.Получить();
	Портал						= ПодключениеКБитрикс.Портал;
	
	стДанные = Новый Структура();
	Для каждого х Из мДанныеДляПолученияТокена Цикл
		стДанные.Вставить(х, Неопределено);                       
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мДанныеДляПолученияТокена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанные[Выборка.ИмяНастройки] = Выборка.ИмяНастройки;
	КонецЦикла;
	
	КодПриложенияAPI 	= стДанные[мДанныеДляПолученияТокена[4]];
	КлючПриложенияAPI 	= стДанные[мДанныеДляПолученияТокена[5]];
	
    ТребуетсяПолучениеТокена = Ложь;
	
	Токен = Неопределено;
	
	Если стДанные[мДанныеДляПолученияТокена[3]] = Неопределено Тогда
		ТребуетсяПолучениеТокена = Истина;
	Иначе
		
		Токен = стДанные[мДанныеДляПолученияТокена[3]];
		
		Если стДанные[мДанныеДляПолученияТокена[1]] = Неопределено Тогда
			ТребуетсяПолучениеТокена = Истина;
		Иначе
			
			ВремяЖизниКлючаAPI = стДанные[мДанныеДляПолученияТокена[1]]; 
			
			Если стДанные[мДанныеДляПолученияТокена[2]] = Неопределено Тогда
				ТребуетсяПолучениеТокена = Истина;
			Иначе
				
				ДатаСозданияКлючаAPI = стДанные[мДанныеДляПолученияТокена[2]];
				
				Если ВремяЖизниКлючаAPI + ДатаСозданияКлючаAPI < ТекущаяДата() + 100 Тогда
					ТребуетсяПолучениеТокена = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТребуетсяПолучениеТокена Тогда
		Токен = ПолучитьТокенАвторизацииССервера(Портал, КодПриложенияAPI, КлючПриложенияAPI);	
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции // ПолучитьТокен() 

&НаСервере
Функция ПолучитьТокенАвторизацииССервера(Портал, КодПриложенияAPI, КлючПриложенияAPI)

	

КонецФункции // ПолучитьТокенАвторизацииССервера(Портал, КодПриложенияAPI, КлючПриложенияAPI)
                                                     
Функция Команда_profile() Экспорт
	СтрокаJSON = "";
	Возврат Отправка_запроса_к_битрикс("profile.json", СтрокаJSON);
                                                                                                       
КонецФункции // Команда_profile()

//CСтруктура возврата result	
//ADMIN	Истина	Булево
//ID	""	Строка
//LAST_NAME	""	Строка
//NAME	""	Строка
//PERSONAL_GENDER	""	Строка
//PERSONAL_PHOTO	""	Строка
//TIME_ZONE	""	Строка
//TIME_ZONE_OFFSET		Число                                                     
Функция Команда_user_admin() Экспорт //Определяет обладает ли текущий пользователь правами на управление настройками приложений.
	СтрокаJSON = "";
	Возврат Отправка_запроса_к_битрикс("user.admin", СтрокаJSON);
КонецФункции // Команда_profile()

//Scope: базовый
//Кто может выполнять метод: любой пользователь
//Метод method.get возвращает два параметра isExisting и isAvailable, которые соответственно определяют существование метода на портале и его доступность для вызова.
//Параметры метода 
//name string  Название метода для проверки в нижнем регистре, например user.get
Функция Команда_method_get(ИмяМетода) Экспорт
	
	стТокен = ПолучитьТокен();
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("name", ИмяМетода);
	СтруктураДанных.Вставить("auth", стТокен.Токен);
	
	СтрокаJSON = "";
	Возврат Отправка_запроса_к_битрикс("method.get", СерилизоватьДанные(СтруктураДанных), стТокен);
КонецФункции // Команда_profile()

Функция СерилизоватьДанные(Значение)
	
    Настройки = Новый НастройкиСериализацииJSON();
    Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    Возврат СтрокаJSON;
КонецФункции // СерилизоватьДанные()
